<?php
$blangs = array(
	'ins_guide' => '程序安装向导，安装前请仔细阅读安装说明里的每处细节。安装包中同样提供了有关软件安装的说明，请仔细阅读，以保证安装的顺利进行。',
	'ins_introduce' => '<p><b>系统安装说明</b>
<p>&nbsp;
<p>感谢您选择 08CMS 网站内容管理系统（以下简称08CMS），以下为08CMS安装简要说明，更多内容请参照官方网站www.08cms.com中的相关详细说明。
<p><b>1、安装环境要求</b>
<p>08CMS 是基于 PHP + MYSQL 的跨平台的系统，可以在 Linux/FreeBSD/Unix 及微软 Windows 2000/2003 等各种操作系统运行。
<p>需要安装 Apache 或 IIS 等 httpd 服务器、php 4.1.0 或以上版本、Zend Optimizer 2.5.7 或以上版本、MySQL 3.23 或以上版本的软件。

<p><b>2、安装文件上传</b>
<p>软件包中的 upload 目录及所含目录及文件，为安装时必须上传至空间的内容。
<p>通过 FTP 软件上传安装文件时，请使用二进制（BINARY）模式进行，否则将无法正常使用。
<p><b>3、目录属性设置</b>
<p>Windows 系统的服务器不需要设置目录属性。
<p>Linux/Unix 类系统的服务器，请确认以下目录或文件属性为（777）可读写模式（以*结尾的目录必须将其子目录及文件一并设置）。
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;系统根目录 ./
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;系统配置文件 ./base.inc.php
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;缓存目录 ./dynamic/*
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;静态文件目录 ./html/*
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;会员频道目录 ./userfiles/*
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;模板目录 ./template/*
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;附件上传目录 ./userfiles/*
<p>您可以通过 FTP 工具或远程登录主机对目录或文件的属性进行修改。',
	'ins_license' => '<p><b>08CMS 软件使用协议</b>
<p>版权所有 (c) 2008-2012, 东莞市鼎越软件有限公司 保留所有权利。
<p>&nbsp;
<p>感谢您选择 08CMS 网站内容管理系统（以下简称08CMS）,东莞市鼎越软件有限公司旗下 08CMS 官方网站：www.08cms.com。
<p>为了使您正确并合法的使用本软件，请您在使用前务必阅读清楚下面的协议条款。
<p>本协议适用于 08CMS 任何版本，08CMS 开发团队拥有对本授权协议的最终解释权和修改权。
<p>&nbsp;
<p><b>一、协议许可的权利</b> 
<p>1、您可以在完全遵守本最终用户授权协议的基础上，将本软件应用于非商业用途，而不必支付软件版权授权费用。 
<p>2、您可以在协议规定的约束和限制范围内修改 08CMS 源代码或界面风格以适应您的网站要求。 
<p>3、您拥有使用本软件构建的网站全部内容所有权，并独立承担与这些内容的相关法律义务。 
<p>4、获得商业授权之后，您可以将本软件应用于商业用途，同时依据所购买的授权类型中确定的技术支持内容，自购买时刻起，在技术支持期限内拥有通过指定的方式获得指定范围内的技术支持服务。商业授权用户享有反映和提出意见的权力，相关意见将被作为首要考虑，但没有一定被采纳的承诺或保证。 
<p>&nbsp;
<p><b>二、协议规定的约束和限制</b>
<p>1、未获商业授权之前，不得将本软件用于商业用途（包括但不限于企业网站、经营性网站、以营利为目的或实现盈利的网站）。购买商业授权请登陆 www.08cms.com 了解最新说明。 
<p>2、未经官方许可，不得对本软件或与之关联的商业授权进行出租、出售、抵押或发放子许可证。 
<p>3、不管你的网站是否整体使用 08CMS ，还是部份栏目使用 08CMS，在你使用了 08CMS 的网站主页上必须加上 08CMS 官方网址(www.08cms.com)的链接。 
<p>4、未经 东莞市鼎越软件有限公司 许可，禁止在 08CMS 的整体或任何部分基础上以发展任何派生版本、修改版本或第三方版本用于重新分发。 
<p>5、如果您未能遵守本协议的条款，您的授权将被终止，所被许可的权利将被收回，并承担相应法律责任。 
<p>&nbsp;
<p><b>三、有限担保和免责声明</b> 
<p>1、本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。 
<p>2、用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未购买产品技术服务之前，我们不承诺对免费用户提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。 
<p>3、东莞市鼎越软件有限公司 不对使用本软件构建的网站中的文章或信息承担责任。
<p>&nbsp;
<p>电子文本形式的授权协议如同双方书面签署的协议一样，具有完全的和等同的法律效力。您一旦开始安装 08CMS，即被视为完全理解并接受
本协议的各项条款，在享有上述条款授予的权力的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本授权协议并构成侵权，
我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。',
);
?>